{
    "title": "Opening Keynote: The New Way to Cloud",
    "presentation_type": "Keynote",
    "categories": [
        "AI and ML",
        "GENKEY"
    ],
    "video_id": "lEUS3_Qjyjg",
    "time": "Aug 29 11:00 AM - 12:30 PM CDT",
    "transcript": ">> SUNDAR PICHAI! >> SUNDAR PIyear's Cloud Next. It's in 2019. Thomas had recently joined as Google Cloud CEO, and he shared his vision for helngcustomers through digital transformation. And I remember feeling like it was the start ofsomething really exciting. Fast forward four years. Thomas and team have built Google Cloud into one of the top enterprise companies in the world. In my conversations with business leaders over the past few years, I've heard a similar theme: They want a partner that's been on the cutting edge of technology breakthroughs, be it from desktop to mobile to theCloud or now to AI, and a partner who can help navigate and lead through them. Theseshif can business function, and significantly change the way we live and work. This isn't just the future. We are already starting to experience the benefits rightnow. As a company, we've been preparing for this moment for some time. And for the last seven years, we have taken an AI-first approach, applying AI to make our products radically more helpful. We believe that making AI helpful for everyone is the most important way we'll deliver on our mission in the next decade. That's why we are using the very best tooling, foundation models, and infrastructure, across both TPUsto perfect Google Search, and bythe way, we are still not done. Today, we are using Generative AI to reimagine the experience and take more of the work out of searching. We call this the Search Generative Experience, or SGE, for short. SGE ufar, helping us learn and improve fast. As we build Generative AI into Search, we are drawing on years of insights and technologydevelopment to harness and deploy AI at scale. Google Cloudis how we provide these same insights, tools, and platforms to help you all innovate, too, sharing the best of our AI directly. And it's been really exciting to see how customers have started using Generative AIin just a short time. Let me give you a few examples. GM is using Google Cloud's conversational AI in its OnStar-connected vehicles, and they'll continue to explore other ways to apply existing da and generating new data with similar characteristics. Our Generative AI products are delivering real results in everysingle discipline. I'd like to take a moment tothank the many customers who areannouncing AI innovations with us right here at Next. (Applause) Today, we're announcing a number of important, new products to help each of you useGenerative AI. First, to help the world's leading customers and develop yeers build AI withrAI-optimized infrastructure and our AI Platform for Developers Vertex AI. Second, to help everyperson use AI, through Duet AI, our always-on collaborator in Workspace and Google Cloud. Third, to bring together thewhole AI ecosystem, to ensure that every organization can succeed in adopting AI. I want to start by talking about our AI infrastructure. Google Cloud's world-leading infrastructure delivers very high and predictable performance, unmatched reliability, and the very best security. We offer this infrastructure in our CloudRegions, in your datacenters with Google Distributed Cloud, and on the Edge. Customers needing sophisticated infrastructure choose Google Cloud. For example, Yahoo is migrating over 500 million mailboxes with almost 550 petabytes of data and almost 500,000 vCPUs -- a massive scale -- to improve Yahoo Mail'sservices and eCommerce experiences. Indian automotive manufacturer Mahindra & Mahindrarelied on Google Infrastructure to sell 100,000 new SUVs booked in just 30 minutes when they launched their online car-buyingsite. Governments like the government of Luxembourg are bringing modern digital servicesto their citizens using Google Distributed Cloud. As Generative AI evolves, sodo infrastructure requirements. Our ultrascale, high reliable AI super computingsystem combine TPU and GPU accelerators, high-performance AI-optimized storage, scalable networking, offloads, and water cooling. We also provide world-class compilers and other software tools to optimize models, delivering the best performance, latency, and overall throughput. And we makeit easy for everyone to consume with support for VMs and Containers. Today, we are announcing sixmajor advances. First, we're announcing our TPUv5e, a new highly efficient version of our custom-designed hardware which supports complex AI models at a fraction of the cost. Second, many customers use Google Kubernetes Engine for AI Workloads. Today, we're launching a new product, GKE Enterprise, to enable Thanks, Jensen. >> JENSEN HUANG: Bye, everybody. Thank you. Thank you,Thomas. >> THOMAS KURIAN: You know, we're starting to see amazing AIinnovation in our everyday lives, whether it's work or playor even what we watch. You know,Fox Sports has>> BROADCASTER: Fox Sports has 1.9 million videos of games, equal to over 27 petabytes of data, and continues to ingest tens of thousands of hours of footage each month. We have trained models using all kinds of data, like celebrity recognition, object detection, and speech, to help understand foul balls versus fly balls or how the crowd reacts. At Fox Sports, we can now search our archives using natural language to find relevant clips, buildingcontent for fans more quickly and more easily than ever. So, let's say the Phillies are in the World Series and we want to look back at memorable Phillies postseason moments. Ourproducers can instantly find Bryce Harper's epic home run, the swing of his life, even if they don't recall which year or which game, and we can even go further. What if we looked for key highlights at that moment? Or even the play call from the game itself? >> The swing of his life! >> JOE DAVIS: When our editors find cool content, they can easily pull out the relevant portion and integrate it into our broadcasts, making for an awesome fan experience. >> THOMAS KURIAN: Thank you, FoxSports, for partnering with us to deliver moments that matter. On top of our powerful AI infrastructure, Google Cloud offers Vertex AI to help developers build apps using Generative AI models and new services like Enterprise Search and Conversations. Developers can use Vertex to discover train, tune, test, evaluate, control, and deploy AI models. Vertex AI is seeing veryrapid growth in usage and new projects. Customers and partnerslike Vodafone, Docusign, Hackensack Meridian Health, Box,and so many more, are already building with Vertex. SaaS partner UKG is helping managers easily create job descriptions with the new Skills Title Graph solution. Estee Lauder Companies uses Gen AI to integrate the voice ofthe customer to drive product innovation and improve the shopping experience. ♪♪ >> NENSHAD BARDOLIWALLA: Good morning, San Francisco! Thank you for that warm welcome. I've had the privilege of traveling around the world with Thomas talking about Generative AI. I said, \"Thomas, for San Francisco, we need to do something amazing. I want to have disco balls on stage.\" I asked Thomas about 29 times. On the 30th time, Thomas said, \"Nenshad, I'll take care of it.\"So, what does he do? He calls Google Cloud CMO Alison waggenfeld and says \"Nenshad wants disco balls on stage.\" I have an idea, why don't we send Nenshad out on Tastage when he sto come out for his demo? So, here I am, ladies and gentlemen! Let's take a look at some ofthe amazing new capabilities that we have in Vertex AI. So, first, we'll start with the model garden. We made a promise to you that we were going to addthird-party models, open source models with our first-party model. And so, you can see our preannouncement of Claude 2 and Meta's Llama 2 right here in theVertex Model Garden. Let's go take a look at Llama 2. The full capabilities of Vertex are available with Llama 2. For example, you can dofine-tuning and reinforcement learning with human feedback directly from a collab enterprise notebook. You can useour AI capabilities directly integrated with Vertex. And in asingle click, you can do deployment to the rock-solid Vertex platform. What does that mean? When you use Vertex, there's no drama with this llama! But that's not all. Just a few days ago, Meta released a new Code Llama model, and I'm pleased to tell you that if you go into Vertex Model Garden, youwill now see Code llama is available right now for all our customers and all of our partners! Thank you. But now, that doesn't mean we don't love our first-party models. Let's go ahead and take a look at some of the new capabilities in the PaLM API protect. Thomas said we have 32k. That's about 80 pages of text that you're able to put inside one of these prompts. So,I'm going to pick one of the most important Seminole pieces it high quality. And I'm going to go ahead and hit Enter. And so, Imagen is going to go generate some beautiful images for us, right on the fly. There with we go, beautiful trucks for our DMV example. But I've gotten a call saying we have a new campaign(Cheers and applause) with our people are already using Duet AI. Let me share a couple of real-world examples with you of what they're doing. Generating an email to a customer for a late payment on an invoice; getting the tone right matters. Writing a blog about clean energy regulations. Duet has been helping customers write, visualize, organize, and connectlike never before. And now, all of these capabilities are available to you with today's GAlaunch of Duet AI in Workspace. This builds on a tremendous momentum of over 300 new featurelaunches across Workspace in thelast 12 months alone, and all ofthis on a secure, reliable, easy-to-administer platform. These product investments are paying off. We're seeing more and more customers switch wholesale to Google Workspace. And today, I am thrilled to announce that Workspace now has 10 million paying customers. Given the excitement around AI, let's talk about what the future holds for Duet in Workspace. We're working on enhancing Duet so that we can gofrom a prompt-based interaction to a much richer, contextual interaction. Duet takes into account what you're working on, whether it's an email, a document, a spreadsheet, meeting, and offers you proactive help, like generating summaries or suggesting creativeideas, and soon, even taking action on your behalf. Let me she will you what I mean with Tony's help. Hey, Tony! >Tone. >> TONY DEVINCENZI: Hey, Aparna. >> APARNA PAPPU: Tony, how aboutwe demo a common marketing use case, writing a creative brief?. The brief typically pulls together customer-specificinformation, like your company'sbrand guidelines, product information, target markets, andusually this is a multi-step, multi--day effort, because you first need to pull together all this information before you can add your unique insights. Tony, do you want to show us how Duet shortens this process? >> TONY DEVDEVINCENZI: Absolutely. We'll start in Drive where I'll selecta prior brief as a starting point. Here's a good one. Now I'll open the Duet side bar. I can already see a suggestion to use a file as a template. So I'll click use this file as a template. Now, Duet needs to know whatkind of document we're trying tocreate. In this case, it's a newline of pet toys called Project Eco Paws. Okay, now in the background, CuDuet is looking f all of the information about Project Eco Paws and combining it with the template that we've selected to create a new deck. Ican see there's a Google Doc, a Google Sheet. Let's click it, see what we got back, and... there it is. >> APARNA PAPPU: That's amazing.That's really brilliant. The deck looks so polished. It's gotthe right content, inserted relevant images, and even brought in charts from the rightGoogle Sheet. >> TONY DEVINCENZI: It's a greatstart, but we're not quite done. I know we want to market these toys to GenZ, so we're going to have Duet help us with that. I'll click this \"add a slide\" suggestion and ask Duet to identify trends to incorporate in the brief for GenZ by typing \"GenZ customer trends.\" Now we're using the PALM2 model and all of the knowledge about Jen 2, plus the content of the generated deck toput together the brand-new generated slide understanding GenZ. I'll click Insert. Boom, there it is. Now we have a greatpoint where we can continue to refine. Aparna, how about that? >> APARNA PAPPU: I absolutely love it! That was really remarkable. I really love how Duet makes suggestions and quitemind-blowing, actually. So, scenario 2:2: Meetings. We've all presentedin meetings and know how overwhelming it can be. You haveto come across as professional and engaging, sometimes even take notes. Duet's got you covered. First, you can present with confidence with our brand-new realtime teleprompter in Google Meet. It follows your voice as you read your speaker notes, and a realtime speech recognition system keeps up withyou, even if you jump ahead or reword notes on the fly. As for notes, Duet is automatically capturing notes, action items, and video snippetsto share with all the attendees at the end of the call. Okay, but what if you're an attendee and not a presenter? Tony? >> TONY DIVENCENZI: As an attendee, your focus should be understanding the content and keeping up with the conversation. This can be especially challenging if you'renot fluent in the presenter's language. With Duet, Meet can automatically detect and translate over 300 language pairs, providing realtime captions for all the viewers. And that's not all. Sayyou joined the ming late, and let's be honest, who doesn't join late occasionally? Duet provides an interactive catch-me-up mode, complete with a summary of what you missed during the meeting. And that is not all. You can even ask it follow-up questions like, let's see here, \"What's been said about GenZ?\" And in just a second, I'm feeling fully caughtup in everything that I missed. Isn't that amazing? >> APARNA PAPPU: That really is amazing. At our Spotlight session, I'll even show you how AI can attend a meeting on your behalf. Thank you, Tony! This is just a small sample of how Google's AI empowers people to get things done in a more compelling and efficient way. Now, best of all, because all of this is core Google technology that runs securely inour cloud, we can make the promise that with Duet AI, your data is your data. None of your data is used to train our models, and our strong, industry-leading permission controls means that no data everleaks between users, departments, or organizations. Now I'd like to turn it overto Brad Calder, who will share more about how Duet AI comes to life in Google Cloud. ♪(Applause) >> BRAD CALDER: Thanks, Aparna! And good morning, everyone! Duet AI can serve as your expert advisor for Google Cloud. And today we are excited to expand our Duet AI in Google Cloud Preview with new capabilities, with General Availability coming later this year. Duet provides AI assistance for developing and deploying your applications withstandard capabilities like code generation but Duet goes furtherby providing you with an expert assistant across your entire software development lifecycle. And Duet also provides you with an intelligentassistant for unlocking the value of your data, where Duet provides a natural language interface for your data, enablesyou to analyze data faster, and helps modernize your data-drivenapplications. Now, let's start with Development. Duet can perform the tasks you expect from a traditional code assistant -- completing, generating, and explaining code. But the difference is, themodel powering Duet AI is not a generic model; it's trained on Google Cloud-specific content and provides context-aware assistance. Now, for development, Duet provides code generation, sourcecitation, test coverage, can design and publish your APIs, can migrate and modernize your applications, can help secure your applications, and so much more. For example, Duet AI in apApigee makes it fast and easy todesign, create, and publish yourAPIs. And now, you can use Duet where you spend your time developing. We support VSCode, IntelliJ, PyCharm and other popular environments. Now let's see how this works with VS Code. Please welcome PriyaPriyaPriyanka! >> PRIYANKA VERGADIA: I hope you're having a good timtime! Whoo-hoo! Great! Well, I'mgoing to show you how Duet AI works. Typically, we know migrating applications can be hard and sometimes takes months and might require an expensive consultant. Let me show you how Duet AI can refactor your code from legacy to modern languages. So, here I am in VS Code andI'm going to show you a databaseconnection function which connects our front-end website to our back-end database. And this function is written in C++,and I'm going to migrate it to Go with the help of Duet AI. So, I open Duet AI Chat right here from within my development environment, write anatural language prompt to convert this function to Go and use Cloud SQL. Now, notice this here. Duet AI knows context of the function that's open on the right, and there we go! It converted our entire function and refactored it in Go. Yay! Not just that. Not only did it do code refactoring for us; it also converted the database connection to Cloud SQL, our managed relational database. Now, this is possible only because Duet AI is trained on Google Cloud-specific products and best practices. Now let me show you one morething. This is going to be code generation based on your specific company code base. So, here I am in a new file. And let's say we are trying to create a better customer experience, so I want to add easy product filtering. So, I type a comment in, because I don't have to write the entire question because Duet AI is helping write that for us. So, Ijust created a comment for Duet,and I'm saying \"Find all products under $10 using my product catalog service,\" and I've asked Duet to generate thisfunction for me. There we go. Wejust accept the function that isgenerated for us. And notice, this is not just code generation, but it also pulls upvery specific methods and functions from our product libraries and isn't this hughuge? Typically, writing code would require wearing specialized knowledge, especially the ones coming from RSDK and Codebase. Now with Duet's understanding of your company's SDK and code base and those frameworks, you can save time, resourcing, training hours, all without compromising quality. Brad, back to you. >> BRAD CALDER: All right! How amazing was that? You just saw how Duet AI can migrate and modernize your application and generate context-aware code. Duet makes it so much easier to develop applications. And we're seeing this from our customers, too. For example, development teams at Wayfair are using Duet AI andseeing strong results in productivity. Now, let's talk about operating and managing your application. A lot of time ♪is spent on building and securing deployments and connecting the dots to investigate issues across your application. And tohelp with this, Duet can automate deployments, ensures applications are configured correctly, helps you quickly understand and debug issues, andcreate more secure and reliable applications. Priyanka, let's show how Duet helps you understand and run your application. >> PRIYANKA VERGADIA: Great. So,before we start, show of hands. Who here has experienced those scary application alerts, \"Uh-oh, something's not right with our app\"? And you're the one who has to figure out what'swrong, right? A lot of us! Right. It's relatable. We'veall been there. Here I am in my email with some scary alerts like that. I'm going to take youthrough how Duet AI can help us dig into this a little further and find out the root cause. So, I open my email. All I know is there are some service errors. We're going to dig in tofind out and with a click to review the incident metrics, I am in the console looking at my metrics Explorer that will take me into our metrics. And sure enough, we see a spike. We kind of expected this because we camefrom the email. But this is the pro Prometheus query that's pulling up this metric. We wouldhave to modify the query, but because we have Duet, I don't have to worry about the query. Ican just type in natural language -- \"show me all services impacted by this error.\" And let Duet create thequery for us. Great. Now it's going to pull up the services and apply it. As soon as we do that, we definitely see that ourcard service is affected. We know that. But there are some other services that are also seeing small spikes here and there. We now know that this is a bigger issue. Now we want to find out why this is happening. So, in order to do that, I get into our logs exploexplorer. Refresh this real quick so I can show you from thebeginning. And I have filtered some of our logs through our errors, and this is one of the errors. Let's go into this one. It's a new illegal buffer. I can sort of see that. But if I expand further, Duet AI allows me to actually understand this error a little bit more in natural language. Click on the \"Explain this log entry\" button and it pulls up Duet AI Chat on the right-hand side, giving me a little more information in natural language about what thiserror is. It is on login service, and it's happening on this particular line. Great! Nowthat I know that, I want to knowhow to fix this error. So, to dothat, I'm going to ask, \"How do I fix an illegal buffer?\" All right. And Duet is working its magic, and it gave us a little bit more about what has happened, what might be the reason, what else I can look at,and it gives me links to go further to do some more digging. Now, let's take a pause here. I showed a lot there. Yourealize we just went from alert to root cause analysis, which would have taken me hours acrossmany different tools. With Duet,it all happens inside Google Cloud Console in under two minutes! How cool is that, Brad? (Applause) >> BRAD CALDER: Very cool and very fast! Understanding what goes on in production is crucialfor providing a reliable application. And Duet AI helps you quickly pinpoint issues and guides you to a solution. Now, let's turn our attention to the sea of data outthere. With BigQuery, we providea complete data suite with best-in-class capabilities for data engineering, data science, and analytics across all of yourdata. With Duet AI in BigQuery and Looker, you can use both natural language and auto-generate SQL, Python, and LOOKML to access and analyze your data. In addition, we're bringing our Vertex AI models toyour data in BigQuery to make itfast and easy for you to use GenAI with your data. And now, you can do all this within our new BigQuery Studio, a unified interface for data analytics with serverless notebooks. With our BigQuery notebooks,for the first time, you can workseamlessly across data engineering, machine learning, and analytics. Priyanka, let's see how easy it is to use Lookerwith BigQuery. >> PRIYANKA VERGADIA: Great. Okay. So, here I am in our Looker space and we're goingto have a realtime chat with my data to understand sales patterns, inventory, and some promotion plans. So, I type my query. Duet AI allows you to type natural language queries within Looker now. So I type my query and say \"Show me total sales from top five seasonal products globally.\" And Duet understands all the metrics; it understands not just what I am asking it to do, but it's also understanding what I'm trying toachieve. Now, what has happened behind the scenes of this query is it uses data model, metrics, and BigQuery tables, and it putsall of them in context to generate answers, like this one,and it knows that demand forecast and inventory levels are some of the other things that I would be interested in exploring as my logical next step. So, it does that for me, and you can see top-selling products. You can see coolers are at risk of stocking out and sunglasses and umbrellas are overstocked inventory. Now, Duet AI didn't just give me data; it gave me actionable information with visuals. And now I can pass these insights to our procurement team to stock more products and to our promotions team to market our surplus inventory, and I can do all of that and send this information and insight in an automatically created slide presentation just like that, in one click. (Applause)back to you, Brad. >> BRAD CALDER: That was absolutely amazing! I love how easy it is to use Looker with BigQuery. Now, companies like L'Oreal,Shopify, and Aritzia, are using Data and AI together in Google Cloud to accelerate their business. L'Oreal uses Duet to analyze their data and gain new insights for better and faster business results. Now, for your application data, at Google Cloud, we offer the best-in-class relational andnon-relational databases. Recently, we announced AlloyDB, our postgres-compatible databasefor superior performance, scale,and availability. AlloyDB can run virtually anywhere. That means Google Cloud, Google Distributed Cloud, AWS, azure, in your data center, and even onyour laptop. And today, we are excited toannounce AlloyDB AI. AlloyDB AI provides pg-vector compatible search that is up to ten times faster than standard postgres. It allows you to easily generate embedings from within your database and it's fully integrated with Vertex AI. In addition, AlloyDB is a great destination for migrating and modernizing your legacy databases such as Oracle and SQLserver. And today, we are excited to announce that Duet AInow powers our Database Migration Service. This is for migrating your Oracle databases to AlloyDB. Priyanka, please show us how easy it is to migrate. >> PRIYANKA VERGADIA: Great! So,Brad, for this one, because databases are huge, we kind of started and kicked off the process of conversion of our schema earlier today, earlier this morning. And let us just show you, we started it in new workspace in a Database Migration Service. We're just going to take you through it now, once it comes up. Great! We click on the conversion workspace. This is kind of what I just talked about, inside the Database Migration Service. And we're going to pull up the actual schema. This schema you see, thegreen checkmarks is the code that is automatically converted,but there are some that need ourattention. And this particular one -- let's take a closer look at this one -- this is an example where Duet understands the semantics of an Oracle-specific function SYSDATEand it recommends local timestamps, but we need the system clock, so we manually changed it to use clock_timestamp. Now, a large application might have thousands of such occurrences or statements which would require manual conversion. But look at the sophistication that we have beenable to achieve as soon as I click on SQL. After one manual fix, Duet AI is able to manualize the solution and applies it across all relevant instances. What used to take months to migrate manually is now radically easier using Duet AI! (Applause)>> BRAD CALDER: Thanks, Priyanka. I love how Duet AI helps you take a giant step towards migrating your Oracle databases to AlloyDB. And we're seeing companies like CME Group move their most-demanding enterprise workloads from Oracleto AlloyDB. Now, Priyanka showed you just a glimpse into what Duet AIand Google Cloud can do for you. Duet provides you with an expert assistant across your entire software development lifecycle. And it also provides you with an intelligent assistant for unlocking the value of your data. You can sign up and start taking advantage of our Duet AI in Google Cloud Preview today with General Availability cominglater this year. Thank you. >> PRIYANKA VERGADIA: Thank you! ♪>> THOMAS KURIAN: No mission is more important than your security mission. At Google, we're combining the most relevant threat intelligence andknowledge of bad actors with thebest tools for your security operations. Let's hear from the expert in cybersecurity, Kevin Mandia. ♪>> KEVIN MANDIA: Thank you, Thomas. And thank you to all of you for being here today. Security is top of mind for every single organization. All you have to do is read the news and you can see a recent attack occurred. At Google and Mandiant, we are on the front lines responding to these attacks and getting a frontline view of it. Last year, Mandiant performed over 1,800 engagementsto help organizations prepare for, respond to, and recover from security incidents. And weare learning firsthand the new and novel ways that cyberattackers are invading the common popular safeguards. And our knowledge of new and novel attacks continues to grow. This year, our investigations are up more than 35% over last year, and securityis a critical component of any digital transformation. What makes Google Cloud unique is we deliver a combination of three must-have capabilities. First, we have frontline intelligence and expertise. Second, we have amodern secuSecurity Operations platform. And third, we have an underlying foundation of a secure cloud platform. So, let me touch on each oneof these briefly. Frontline intelligence makes you situationally aware so you can operate in the current threat environment with confidence. Youhave to know what you're up against to defend from it. And we take insight from incident response work that Mandiant is doing, plus Google's visibility from running billion-user Internet services, plus open sourced and crowdsourced intelligence. We fuse it together. We make it actionable,at scale, across our products. We take this knowledge and we work tirelessly to defend you and close the window of effectiveness of attacks. And we believe Google Cloud has the best innovation in the industry. We use what we learn on the front lines to drive our product evolution. And our Google Security Operations platform, called Chronicle, enables security teams to detect, investigate, and respondto cyber threats with the speed,scale, and intelligence of Google. We recently launched our Chronicle CyberShield. This solution allows governments to apply our security operations capabilities across their environments. CyberShield breaksdown those information silos with different government agencies, looking up through thesoda stall, and it centralized security data so you can get national situational awareness in your cyber domain. Beyond technology, CyberShield provides training and upskilling of cyber talent to help nations defend their cyber domain. The Israeli National Cyber Directorate and Google are working closely together to raise their nationaldefense, and they are at this conference here speaking tomorrow. We're already seeing interest around the world from other organizations and governments, and we have a unique partnership model that blends technology, methodology, and most importantly to security, trust. And while a modern platform is critically important, ultimately, we want to help you achieve the securityoutcomes that your organization is aiming for. So, today, we arelaunching Mandiant Hunt for Chronicle. Security operations teams can now get threat huntingon their Chronicle data by Mandiant experts who use our latest frontline intelligence toexpose attacker activity before it negatively impacts your organization. In short, folks, having Mandiant Hunt for Chronicle is like adding thousands of security experts toyour team overnight. And finally, we provide a secure-by-design, secure-by-default cloud platformto run your business on. The importance of this strong foundation cannot be overlooked. According to cloudvulndb.org, a community-based website trackingcloud vulnerabilities and security issues, Google Cloud had 75% fewer critical and high-severity vulnerabilities since 2020 than one of the majorcloud providers and 60% fewer vulnerabilities than the other major cloud provider. (Cheers and applause)thank you. We're not built on a legacy foundation, nor are we legacy first in terms of our core services. And the consequence of a legacy-first innovation approach is clear when you see how often other infrastructures are being exploited. But even armed with the right intelligence, product, andinfrastructure, security is still too challenging for the majority of organizations, and this is where AI is going to change the game for all of us. Currently, security analystsare overwhelmed with the security events that they see every day. Duet AI reduces analyst time spent writing, running, and refining searches and triaging complex cases by seven times. And to show you how, I'd like you to welcome Steph Hay. Steph? ♪>> STEPH HAY: Thanks, Kevin! Andhi, folks! I'm going to show youthree ways that Duet AI assists you in cybersecurity. One, by generating AI summaries to describe threats; two, by searching for patterns in your security data to determine if you've been affected; and three,by recommending actions to take,both in response to alerts, but also proactively improve security by closing down attack paths. I'll start by researching the latest in Mandiant Intelligence. Here, I see there is some recent activity from a threat group called APT43, so I want to learn more about that. I'm going to go ahead and search this. Now, normally, I'dhave to parse through about, hmm, let's see, 11,571 search results to start putting together an understanding of this actor's tactics. But now, with Duet AI, I see a summary onthis threat actor instantly generated for me. Further, the Duet AI model here is grounded, which reduces LLM hallucinations so I have accurate summaries. So what I learn here is thatone of this actor's tactics is to fraudulently mine cryptocurrency to fund illicit activities, which is pretty bad stuff I would like to prevent. So, I want to see, though, if we're being targeted,so I'm going to go ahead and search for \"cryptomining attack,\" let's say \"Google Cloudover the last week.\" I'm searching all of our event data here. And normally, I would needto use specialized syntax to conduct that search, but now I see Duet automatically has translated this search to the system's unique data model. And now I'm searching petabytes of data, relatively instantly. I can also refine a line if I needto. And as those events are loading here... let's see. Therewe go. I see in the results here that I've got an existing alert that I'm going to go ahead and check out. So, let me see here. Affected entity. Here's the alert. I'm going to go aheadand take a look at that for moreinformation. And normally, I would -- let me minimize this, get a little more room -- I'd have to go through all of this important information here, thismetadata, to really understand what's going on in this particular case. But now, I go to the Overview. I see Duet AI has summarized the findings, that it detected this issue, including what's been affected, and is even recommending the next steps to respond. So, that's what I'm going todo. I'm going to go check out more on this finding in SecurityCommand Center. And in doing that, I see a finding's being loaded here. And again, normally, I'd have to have a tenured understanding of this, going through all of this reallyimportant metadata here, maybe even reviewing some of the JSON. But now, I see that Duet has summarized this for me, including which resource is being exploited, so I can shut it down. Duet also summarizes for me potential attack paths, showing me the attack exposure for the particular affected resource, which I could, of course, go into, if I'd like to, to see full attack path, or I could generate a summary that tells meexactly what's going on. For example, if I needed to improve my security posture, I'd definitely want to rotate this service account key and lock down a couple over-permission accounts. In short, Duet has translated my search queries, summarized information about thethreat, and prioritized where I should focus so I don't have to deal with thousands of potentialalerts. And as a result, I can fix the issues fast so we're in a stronger security posture, andI'm making the world a little safer, too. (Applause)Yeah, pretty excited. These Duetcapabilities are in preview and we have even more tomorrow to show you in our Security Spotlight, so I hope to see you there. Until then, back to you, Kevin! >> KEVIN MANDIA: Thanks, Steph. Great salmon shirt. We'veonly just begun to realize the power of applying Generative AI to security. Together with our extensive security partners and our ecosystem, we can accelerateyour security transformation andhelp make you safer with Google. Now let's welcome Thomas back to the stage for the last section of our keynote. ♪>> THOMAS KURIAN: Thank you, Kevin. You know, we promised when we acquired Mandiant that the future of cybersecurity requires combining the best intelligence to understand emerging threats with the best AI models to protect and respond. Today, you saw us fulfilling that promise to keep each of you safer. We are working with a broad ecosystem of partners to make it easy for our customers to adopt our Cloudand Generative AI Platform. Our partner ecosystem has over 100,000 companies in Partner Advantage with new Generative AIpartners joining every single day. These include Foundation Model Builders, SaaS and Application Providers, infrastructure and Platform Partners, Data Providers and System Integrators and Consultancies. We're working with many SaaS companies to bring our Generative AI technology to transform every business process in Finance, Human Resources, Marketing, Sales, Customer Service, Procurement, Legal Departments, Manufacturing and Supply Chain. One of our most important partners is Workday. We're also one of their customers. Please join me in welcoming Workday Co-founder, Co-CEO and Chairman Aneel Bhusri. ♪>> ANEEL BHUSRI: Hey, Thomas. How are you? >> THOMAS KURIAN: Great to have you here. Can you speak to how Workday and Google Cloud's partnership has evolved? Quite important for all us customers. >> ANEEL BHUSRI: So, our partnership really started in 2011, when we became a Workspacecustomer. 2012, you became an HRHCM customer. And most recently, we started working together on GCP. And I'm proud to say that Workday, Financial, and HR applications are now liveon Google Cloud, and we've got our first set of customers that are experiencing that great world. >> THOMAS KURIAN: An exciting time with all these new innovations in AI. How will our work together, particularly around these new innovations, show up for our customers? >> ANEEL BHUSRI: Well, just likethe whole world, Gen AI is a major emphasis right now. But inour case, we've been working with AI and ML going back to 2014. We've been building our own large language models for years and now we're working withyour large language models in somewhat of a hybrid approach. And what I love about working with Google is the strong alignment on security, ongovernance, on humanity and doing it with an ethical framework, so it's really been agreat experience, and it's really exciting to see the two of us go to market together now.>> THOMAS KURIAN: You've got some new use cases. Do you want to talk a little bit about job description and other things your teams are looking at? >> ANEEL BHUSRI: Yeah, so leveraging Google's Gen AI capabilities, and with all within Workday, we can take job data, job location, and skills and basically create a very strong job description. It's content generation, like so muchof the Gen AI, and it saves a ton of time. And all of the use cases we have are really all about business value, so that's one. The second use case is usingGoogle AI, again, to basically build or leverage our skills API, which is an inference engine that customers can build forward tension and upskilling in this new world of skills which is where HR is going. So it's been good to do all of thisco-innovation together. >> THOMAS KURIAN: Thank you for joining us. Thank you for the work our teams are doing together and we're helping everyone with our partnership with Workday. >> ANEEL BHUSRI: Thank you, Thomas. >> THOMAS KURIAN: Great having you. You know, we're partneringwith applications and SaaS companies, both as a technology provider and to help our shared customers benefit from our complementary offering. In addition to Workday, we're working with other SaaS companies, including Box, Canva,Docusign, as well as Jasper, SAP, and more. We're also integrating our Infrastructure, Vertex AI, and BigQuery with Infrastructure and Platform Partners to make it easy for enterprise data to be used and to provide a rich set of AI-powered experiences. These include Replit, LabelBox, Snorkel AI, Gretel, Mongo DB, DataStax, NetApp, and many more. Making Generative AI useful also requires large sets of prepared data from multiple sources. We have thousands of third-party data sets available from industry leaders in our data and AI platform. Today, we're announcing an expanded partnership with Bloomberg to make their data available in our Data and AI cloud. We are also partnering with leaders like Dun and Bradstreet and MSCI. And our Systems Integrate partners are investing to build dedicated practices and train more than 150,000 people on Google Cloud Generative AI. (Applause) We are grateful for the thousands of partners who are investing to develop solutions with Google Cloud. In closing, we showed today that three most important ingredients that will power this next chapter of digital transformation. One, ourworld-class infrastructure and platform for building AI. Two, our always-on collaborator, DuetAI, to help you use AI in both Workspace and Google Cloud. And three, our investment in your success across all industries and business functions, togetherwith our broad partner ecosystem. We appreciate being on this transformation journey with you. Together, we are building the new way to cloud. (Applause) There is so much more for all of us to explore together this week at Google Cloud Next. Have an amazing show! Thank you! ♪ ♪"
}